Autodesk.Revit.DB.ExportFontKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportFontKey.OriginalFontName
The original font name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontKey.#ctor(System.String)
Constructs a new ExportFontKey using an input font name.
originalFontName:
The original font name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontKey.#ctor
Constructs a new default ExportFontKey.
Since:
2014

Autodesk.Revit.DB.ExportFontKey.#ctor(Autodesk.Revit.DB.ExportFontKey)
Constructs a new copy of the input ExportFontKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontKey
A key used to represent an item stored in an Autodesk.Revit.DB.ExportFontTable.
Since:
2014